Repository: atlas-studios/Session2-G9
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 在又一记迟缓术之后，林立突然停下了脚步，他再没有象先前一般，放出迟缓术转身就跑，这一次他牢牢的站在那里，大段大段的咒文从口中倾泻而出，就仿佛完全没有看见迎面扑来的狮蝎一般。
en_us: After unleashing another Delaying Spell, Lin Li suddenly broke his stride. He did not turn and run after unleashing the Delaying Spell like how he did before. This time, he stood rooted to the spot, and large verses of spells poured out of his mouth as if he had not noticed the advancing Manticore right in front of him.

source: 在场众人中不乏锻造专业的玩家，神之金属的价值他们是再清楚不过了。
en_us: There was no lack of professional blacksmiths in the crowd. No one knew the value of the divinity metals better than them.

source: 在场众人至少都是五级以上的魔法师，除了林立这种半吊子之外，又有谁没听过强能水晶的大名，那几乎是每一个魔法师都梦寐以求的东西，强大的镇定心神效果，几乎完全避免了施法时的魔力反噬，对于一个魔法师来说，魔力反噬比敌人更加可怕，更何况强能水晶还能增幅冥想效果，只要放在身边，冥想效果就能提升到恐怖的程度。
en_us: The people present were mages of at least level-five and above. Other than a dabbler like Lin Li, who had never heard the great name of the Strong Energy Crystal, it was something that almost every mage yearned for. Its powerful calming effect prevented the counter-reaction of mana during the unleash of spells. To a mage, the counter-reaction of the mana was much more fearful than the opponent. In addition, the Strong Energy Crystal could amplify the effects of meditation. As long as one had the crystal by their side, the meditation effects could be raised to a terrifying level.

source: 在场众人非富即贵，都是加洛斯有头有脸的人物，其中最差也至少是某支势力首脑的亲信，他们又如何听不出，刚才老格林－伯恩塞德话中的意思？
en_us: All the people present were either wealthy or respectable, and they were all prominent figures in Jarrosus. Even the lowest among them were the cronies of the leaders of a certain force. How could they not hear the meaning behind Old Grimm Burnside's words?

source: 在场所有人中，大概也只有克伦威尔还没明白过来。
en_us: Among all those present, perhaps it was only Cromwell who did not understand.

source: 在场所有人都可以很清楚的感觉到，老梅林的魔力正以极快的速度恢复着，先前那一战带来的消耗，瞬间就会被强能水晶填满，用不了几秒钟的时间，这个看似有些虚弱的老人，就又会变成那个加洛斯最强大的魔法师。
en_us: Everyone could clearly feel that Old Merlin was recovering his mana at lightning speed. The depletion brought about by the earlier battle was quickly brought to the full by the Strong Energy Crystal. In just a few seconds, the seemingly frail old man would become the most powerful mage in Jarrosus.

source: 在场的人每人都欺负过人，都打过家族的低级子弟，他们打人的时候也很凶残，但此刻却都被江逸的手段吓到了，脑海内浮现的唯一念头就是，以后千万不能招惹此人……
en_us: Everyone here had once bullied someone, or beaten the lower classed clansmen. They were also extremely ruthless when they were beating people up, but right now they were all shocked by the measures of Jiang Yi. There was only one thought in their minds, that was to never incite the wrath of this man in the future...

source: 在天星大陆，人人都能借助金木水火土等等最基本的天地元气来提炼元力，因为只有体内拥有浑厚的元力，才能施展出各种威力强大的武学神通，开山裂石，飞天遁地都不在话下。但要是没有元力，哪怕武技神通比划得再精妙，哪怕掌握了几万种武技的口诀，你也施展不出来，只能做个废物！
en_us: The inhabitants of the Stellarsky continent regularly borrowed the powers of the basic elements—metal, wood, water, fire, and earth—to cultivate and expand their essence force, as only those with a great amount of essence force could put various techniques of great might to use. Even splitting entire mountains, flying freely in the sky, and becoming virtually invincible was possible with enough essence force. However, without any essence force, no matter how skilled one was in martial arts and regardless of how many techniques one had mastered, it would all be rendered useless. Without essence force, one couldn’t execute even the most basic martial art!

source: 在天羽城内，姬家就是土皇帝，没有家族敢招惹姬家。姬家子弟倒是也很自律，很少欺压各家族子弟。其余家族则不同了，为了各家族的利益经常明争暗斗，数百年下来四大家族积怨颇深，家族子弟在天羽城内斗殴那更是家常便饭。
en_us: Within Skyplume City, the Ji Family was akin to a royal family. No other family clan dared to provoke the Ji Family. For their part, Ji Family descendants were themselves very disciplined and rarely bullied or oppressed the descendants of other family clans. The other remaining family clans acted differently. The clans regularly fought with each other openly and maneuvered against one another covertly to attain advantages in their own interest. The four great families had deep grudges for each other, developed over centuries of conflict, and fights between descendants of each family clan were truly commonplace and not out of the ordinary.

source: 在太阳快要下山的时候，凯文终于是守得云开见月明，生生等到克伦威尔问起葛瑞安来。
en_us: Kevin finally saw a silver lining when the sun was about to set, he had waited long for Cromwell to ask about Gerian.

source: 在太阳落山之前，众人又走进了一片密林，照罗麦格雷尼说，只要出了这片密林，再往前走不了多久，就能够看见加洛斯城了。
en_us: They had walked into another dense woods before the sun set. According to McGrenn, as long as they passed through this forest and walked a little farther, they would be able to see Jarrosus City.

source: 在奥法药剂出来之前，这一个个的，又有谁真把魔法公会放在眼里过？包括与自己交情不错的老奥丁，如果不是因为自己坐在会长的位置上，这个控制着加落斯城所有杀手的老家伙，又岂会给魔法公会半点面子？
en_us: Before the emergence of the Arcane Magic Potion, who truly had regards for the Guild of Magic? Same goes for Old Odin, whom he shared a friendly relation with. If he had not been the President, that old chap who controlled all the assassins in Jarrosus would not have given the Guild of Magic any respect.

source: 在宁神花里发现几片黑莲花花瓣，这种运气要是传了出去，非吓出一堆神经病不可……
en_us: If news of his luck coming upon a few black lotus petals among the peacebloom went out, it would have scared some people out of their wits...

source: 在座一老一少，也算是药剂学顶峰的人物，一个大师一个宗师，可两人在那谈了半天，也没能研究出个所以然来，倒是一番讨论让老格林学了不少东西，以前没听过的没想过的，一下全冒了出来，各种闻所未闻的新奇理论，更是让老格林大开眼界。
en_us: The old and the young in the seats were considered the top figures in pharmaceutics—one was a master and the other a guru. But they had talked for a long time and yet still failed to figure out any solution. Instead, Old Grimm had learnt a lot from the discussion. What he had never heard nor thought about before came up in his head all at once, and all kinds of novel theories that were unheard of had been an eye-opener for Old Grimm.

source: 在无尽世界当中，深邃之银是真正的可遇而不可求。
en_us: In the Endless World, the deep silver could only be found by luck but not by searching.

source: 在昨夜突破了铸鼎境二重之后，江逸心里不仅不再畏惧江如虎，反而大摇大摆的上山，希望江如虎会来堵他，他好狠狠出一口恶气。
en_us: After making a breakthrough and reaching the second stage of the Cast Tripod Realm the night before, not only did Jiang Yi not have any fear nor dread for Jiang Ruhu in his heart; he instead swaggered up the mountain, hoping that Jiang Ruhu would stop him. He hoped to take the opportunity to ruthlessly get his revenge.

source: 在杨管事请示了费老后，武殿做了一个决定，将江逸命名为最顶级的紫金陪练，同时通告整个武殿，苍狼陪练每天只陪练三场，每一场陪练需要——百两紫金。
en_us: After Manager Yang asked Elder Fei for instructions, the Martial Arts Hall made a decision to designate Jiang Yi as the highest-level purple gold token-grade sparring partner. At the same time, they announced throughout the entire Martial Arts Hall that the sparring partner "Lone Wolf" would only spar in three matches every single day, and each sparring match would require - one hundred taels of purple gold.

source: 在林立看来，胖老头那愤怒的神态，无非只是一种态度，一种支持自己的态度。
en_us: From what Lin Li saw, the fat old man's rage was merely just an attitude, an attitude of support for himself.

source: 在格林－伯恩塞德漫长的生命当中，早已经习惯了成为众人的焦点，在一众宾客的包围之下，他那张布满皱纹的脸上依旧带着温和的微笑，甚至还冲几个相熟的家族首脑点了点头，算是打过了招呼。
en_us: In Grimm Burnside's long life, he had long gotten used to being the center of attention. Surrounded by the crowd of guests, his wrinkled face still wore a gentle smile, and he even nodded at several familiar family leaders in a greeting.

source: 在武殿内闭关第十三天，江逸照例和翊凌雪对战了半个时辰，这次翊凌雪却没有匆忙离去换衣裳，反而好奇的询问起来。
en_us: On the 13th day of seclusion at the Martial Arts Hall, Jiang Yi finished his customary sparring practice with Yi Lingxue. Afterwards however, instead of hurriedly leaving to change like she usually did, Yi Lingxue stayed behind and questioned Jiang Yi curiously.

source: 在气爆术的力量挤压下，两枚泰罗果开始慢慢变形，随着林立释放出的魔力慢慢加大，两枚圆圆的泰罗果最终变成了薄薄的两片。
en_us: Under the compression of the Gas Blast Spell, the two terocones began to deform slowly. As the mana released by Lin Li slowly increased, the two round terocones eventually turned into two thin pieces.

source: 在江家，江逸小时候因为自身体质以及大长老的关系，尝试过不少心法，也见识过很多种颜色的元力。除了水系功法大多是蓝色，火系功法大多是红色外，比如木系功法多数绿色，土系功法多数黄色……但他从没见到过能练出黑色元力的功法！
en_us: In the Jiang Clan, due to his relationship with the Grand Elder as well as his personal physical condition, Jiang Yi had been trying many methods of spirit training and had similarly witnessed essence force of numerous colors. Water-element techniques usually produced blue essence force, and fire-element techniques usually produced red. There were also wood-element techniques, which produced green and earth-element techniques which produced yellow. Yet he had never observed a technique that could produce black-colored essence force!

source: 在江豹的两条腿被江逸活生生的踩断，他目光锁定江如虎后，江顾水两人终于忍不住了，身上元力疯狂运转，气势腾起，江顾水爆喝起来：“江逸，最后给你一次机会，现在罢手，等候刑堂处理，否则别怪我们两人不客气！”
en_us: Once Jiang Bao's legs were forcibly broken by Jiang Yi's trample, his sights were locked on Jiang Ruhu. Jiang Gushui and Jiang Rulang couldn't hold back any longer and began circulating their essence force. Putting on an imposing aura, Jiang Gushui roared, "Jiang Yi, this is your last chance. Stop right now and wait for the Disciplinary Court to serve your punishment. If not, do not blame us for being impolite!"

source: 在江逸离开之后，那满头灰白头发的柳长老却突然走出偏厅进了丹房内查看了一遍，出来后很是满意的点了点头呢喃一声，再次走进了偏厅研究他“意外炼制”出来的地阶丹药……
en_us: After Jiang Yi left, Elder Liu, the man with a head full of grayish white hair, suddenly walked out of the side room and entered the Elixir Room to check. When he left, he nodded his head with satisfaction and, muttering to himself, once again entered the side room to research on his "accidentally refined" Earth-tier elixir...

source: 在江逸踢出第六腿的时候，江松的右腿小腿终于传来一道骨头碎裂声，江松也跟着惨叫起来，再也无法支撑身体重心，一下摔倒在地，抱着右腿痛嚎起来。
en_us: On the sixth attack that Jiang Yi released, Jiang Song's right leg finally released the sounds of bones being broken. Jiang Song's agonized screams followed suit. No longer able to hold up his body weight, Jiang Yi's body crashed to the floor. He held his right leg and cried in bitter pain.

source: 在没有元力的情况，武者对战只能完全依靠战斗本能和反应速度，以及武技了。这样对练起来能大大的增强武者反应速度，和武技的熟练度。
en_us: In a circumstance where there was no available essence force to use, martial artists seeking combat could only rely completely on the combat instincts and response speed, as well as their skills in martial arts. In this way, during sparring training, a martial artist's reaction speed and level of proficiency could be greatly increased.

source: 在泰罗果汁液开始沸腾之后，林立又小心的抓起银须草和太阳花，两中草药几乎同时投进烧杯当中，紧跟着就是一片白色雾气升腾而起，一股浓郁的药味在房间中弥漫开来，其中所蕴涵的神圣力量，就连身为战士的伊娜和红发美女，也是不由得为之动容。
en_us: After the terocone succus began to boil, Lin Li carefully grabbed the silver hairgrass and sungrass. The two herbs were added into the beaker almost simultaneously, which was followed by a white mist rising into the air and a strong medicinal smell permeating the room. Even warriors like Ina and the redheaded beauty were deeply moved by the divine power contained in it.

source: 在滚动的巨龙之血中，一条条蓝丝正慢慢溶解。
en_us: Threads of blue were slowly dissolving in the boiling dragon's blood.

source: 在看清楚花从中的点点灰色时，林立觉得自己真是连心都快跳出来了。
en_us: Lin Li felt his heart leap upon seeing the little gray dots among the flowers.

source: 在研究过地图之后，麦格雷尼告诉林立：“大概还需要一天的时间，我们才能走出落日山脉。”
en_us: After studying the map, McGrenn told Lin Li, “It would probably take another day to get out of the Sunset Mountains.”

source: 在确定江逸不能修炼后，收养他的大长老瞬间便苍老了十岁有多，他从此整日闭门不出，翻阅各种符箓古籍，四处寻访符文高手，希望有朝一日能够破解封印。
en_us: When he confirmed that the Jiang Yi could no longer cultivate essence force, the Grand Elder spent entire days indoors, reading all kinds of ancient texts and old talisman books in an attempt to find a solution to his god-grandson’s problem. He went to the edges of the world in order to seek the assistance of linguists and masters in talisman magic, all in the hopes of being able to break the seal one day. The poor Grand Elder... in mere months, he looked as if he had aged ten years!

source: 在离两人不远的地方，还有几家势力的首脑在那张望，都想凑过来跟葛瑞安套套交情。
en_us: Not far from the two men, the leaders from several forces were looking around, trying to join in and form a friendship with Gerian.

source: 在第一魔法师的绝对力量面前，那些一直蠢蠢欲动的魔法家族，想必会安分一段时间才对。
en_us: Before the absolute power of the number one mage, the mage families who had been waiting for their chances would most likely remain well-behaved for a period of time.

source: 在管事房被荣管事骂了个狗血喷头，江逸快步走出西门上了西山清点药草，好在这次还是在西山药田做杂物，荣管事没有提及令牌的事情。而且上西山时，山下的家族护卫都认识他，倒是没有要他出示令牌。
en_us: After being viciously scolded by Chief Rong at the Housekeeping Chamber, Jiang Yi walked out of the Western Door in a quick pace and headed up the Western Hills to take stock of the medicinal plants there. Thankfully, this time he was once again tasked with doing odd jobs around the medicinal plantations of the Western Hills, and Chief Rong had not mentioned anything about the command token. Additionally, while he was heading up the Western Hills, as the clan guardsmen at the foot of the hills recognised him, they did not require him to reveal his command token.

source: 在老格林想来，如今反正要指点林立，不如让这个小姑娘也在一旁听听，说不定能让她学到一些东西，不过尽管心里这么想着，老格林还是很礼貌的征询了一下林立的意见：“小伙子，你没意见吧？”
en_us: In Old Grimm's mind, he was about to advise Lin Li anyway. It might be better to have the little girl sit in and listen as well, and perhaps she could learn something. Despite his intentions, Old Grimm still asked Lin Li politely for his opinion. "Kid, is it okay with you?"

source: 在老格林的追问之下，罗琳无奈将那天的事说了一遍，老格林听着听着，眉头就不由皱起来了，等到罗琳把事情讲完，老人也不由长长的叹了口气：“难怪我刚才就觉得，你们两个小家伙好象有些别扭，原来是这么回事……不过小罗琳，这次的事情，可真是你不对了，身为一个医生，是不能太任性的，特别是在关系到病人生死的情况下。”
en_us: Pressed by Old Grimm, Rowling had no choice but to recount what had happened that day. Old Grimm's brows furrowed as he listened on, and when Rowling had finished her story, Old Grimm let out a long sigh. "No wonder I felt you two kids were behaving awkwardly just now, so that's what happened... But little Rowling, for this matter, it was really you who's in the wrong. As a doctor, you can't be wilful, especially in a situation concerning the life and death of a patient."

source: 在老梅林与葛瑞安一战之后，梅林家族仿佛忽然之间就沉寂了下来，而与梅林家族一起沉寂的，还有魔法公会的药剂师。
en_us: After the battle between Old Merlin and Gerian, the Merlin Family seemed to have quieted down all of a sudden. And together with the Merlin Family, the pharmacist from the Guild of Magic had also stayed quiet.

source: 在老梅林看来，这将是整件事最好的结果。
en_us: For Old Merlin, this would be the best outcome for this whole event.

source: 在老法师眼中，魔力永远是最珍贵的东西，哪怕是一丁点魔力，也可能让你放出最后一个保命的法术，象林立这样只是为了衣服的整洁，就毫不吝啬的浪费魔力，在安度因看来简直就是在犯罪！
en_us: In the eyes of the old mage, magical power would always be the most precious of things. Even the smallest of power could let you unleash the last spell—enough to save your life. What Lin Li had done was a crime in Andoine's eyes, wasting his power just for the sake of keeping his clothes clean!

source: 在落日山脉上的每次露宿，都等于是将生命置入险境。
en_us: Every night spent out in the open in the Sunset Mountains was equal to putting life in danger.

source: 在葛瑞安与老梅林的战斗中，林立学到了太多的东西。
en_us: Lin Li had learnt too much from the battle between Gerian and Old Merlin.

source: 在葛瑞安的强硬手段下，小小的骚动就这么被压下去，但谁都知道，这些被压下去的声音，其实从未真正消失，他们只是在耐心观望。
en_us: Under Gerian's tough approach, the small ruckus was crushed. But everyone knew that in fact, these suppressed voices never really disappeared. They were merely waiting patiently.

source: 在解释什么叫等级认证的时候，葛瑞安脸上虽然一直带着可鞠的笑容，可其实心里却是说不出的紧张，这关系到一个足以媲美格雷斯科的魔法天才，更关系到一个不满二十岁的药剂大师，葛瑞安甚至觉得，自己现在的心情，比当年晋阶大魔导士时更加紧张。
en_us: Gerian kept a smile on his face when he was explaining what the level certification was, but in his heart, he felt an indescribable nervousness. This was about a magical genius who could rival Geresco, and it was even more about a Master of Potion under the age of twenty. Gerian had even felt he was more nervous now than he had been when he had advanced to an Archmage.

source: 在这一刻，安东尼－罗林甚至想过，要扑上把这个疯女人活活掐死。
en_us: At this moment, Anthony Rolin even thought of jumping on this woman to strangle her to death.

source: 在这一刻，就连欧灵脸上，都多多少少露出了几分激动的神色，法兰王国的魔法师中，又有谁没听过安度因的大名？
en_us: Now, even Orrin's face expressed some form of excitement. Among the magi in Felan Kingdom, who had not heard of the great name of Andoine?

source: 在这一瞬间，所有人都呆住了。
en_us: In that instant, everyone was dumbfounded.

source: 在这个世界上，恐怕没人能够理解林立现在的心情，就算与他最为亲近的安度因也同样不能。
en_us: No one in this world could ever understand how Lin Li felt at the moment, not even Andoine who was the closest to him.

source: 在这个时候，他其实更关心大厅里的拍卖。
en_us: At this time, he was actually more concerned about the auction going on in the hall.

source: 在这个时候，大概也只有林立这个半吊子还搞不清楚状况，他正很奇怪的望着老梅林，心想这老家伙怎么笑得这么下流，莫非掌握了什么秘密武器不成？不懂就问是个好习惯，于是林立用手肘碰了碰身旁的凯文，很虚心的向他请教道：“那老家伙手里拿的，究竟是什么东西？”
en_us: Perhaps it was only a dabbler like Lin Li who had not gotten a hold of the situation. He stared puzzled at Old Merlin, thinking about how despicable that old fellow's smile was. Could it be that he had a secret weapon with him? It was a good habit to ask when one doesn't know, hence he nudged Kevin with his elbow and asked in a humble way, "What is that thing that the old fellow has in his hands?"

source: 在这位面前夸我是魔法天才，你这不是把人往火坑里推吗！
en_us: Lauding me as a magic genius in front of this someone, isn’t he trying to push me into a pit of fire!?

source: 在这护卫看来，绝对的力量可以碾压一切武技，更别说江逸这实力根本不能发挥武技的威力，就如刚才江逸使出“摔碑手”一样被他轻松荡开般。
en_us: As that guard saw it, his absolute power could crush all martial arts techniques—let alone Jiang Yi's abilities which could not even manifest the innate power of any martial arts techniques. As an example, the Wrestling Hand technique that Jiang Yi used earlier was easily deflected by him.

source: 在这武殿内修炼速度果然快了两倍，达到铸鼎境二重黑色元力凝练了，增幅药力的时间也增长到大半柱香时间，感受到丹田内井水般喷出的蓝色元力，江逸整个人都兴奋的不得了。
en_us: The power cultivation speed in this Martial Arts Hall was indeed faster by two times. Having reached a power-level at the second stage of the Cast Tripod Realm and producing condensed black essence force, with the time that the elixir medical efficacy lasted also having extended up to more than two and half minutes of time, as well as sensing that blue essence forces were splurting out of his dantian like a well of water, Jiang Yi felt completely and uncontrollably excited.

source: 在这狂风骤雨般的攻势中，林立依旧疲于奔命。
en_us: Lin Li was constantly struggling to keep up among the relentless attacks.

source: 在这种要命的时候，葛瑞安绝不想跟梅林家族开战。
en_us: At this critical point, Gerian would definitely hate to battle out with the Merlin Family.

source: 在这要命的时候，谁还有空跟他研究什么红牛饮料，几乎是林立话音刚落，葛瑞安就已经拔开了瓶塞，仰头将一整瓶唤醒药剂倒入口中，一边感受着其中蕴涵的纯净魔力，一边还砸巴着嘴回味那酸酸甜甜的味道。
en_us: Who had the time to study about the Red Bull's drink with him at this critical time? Before Lin Li's voice faded, Gerian had already removed the bottle cap and poured the Awakening Potion into his mouth. He took in the pure mana contained in it while savoring the sweet yet sour aftertaste in his mouth.

source: 在这近乎变态的生长条件下，黑莲花的出现，早就被公认为不可能的事，当初林立为了在药剂学上有所突破，曾经高价求购黑莲花的消息，可是数十万金币的悬赏挂出去，却连个泡都没能冒起来。
en_us: Under such perverted conditions, the emergence of the black lotus was universally acknowledged as impossible. Lin Li had put out a high price for news on the black lotus in order to achieve a breakthrough in pharmaceutics. But not even the slightest simmer of bubbles could be seen even after putting out a reward of hundreds of thousands of gold coins.

source: 在那一刻，欧灵简直不敢相信自己的眼睛，那种感觉，完全就好象是在做梦一样，一位精通药剂学的传奇法师，竟然会拿着一瓶药剂向人请教，而且请教的还是自己的室友……
en_us: At that moment, Orrin could hardly believe his own eyes, feeling as if he was in a dream-a legendary mage, proficient in pharmaceutics, was actually approaching another person for advice about a bottle of potion, and the latter was his very own roommate...

source: 在那一场战斗中，林立实在收获了太多太多的东西。
en_us: Lin Li had gained so much from the battle.

source: 在那些巍峨的城墙宫壁上，在那些华丽的宫殿阁楼内，在天庭的地面、街角，突兀地浮现出谁也数不清的七彩符文。
en_us: The towering palace walls, the insides of the majestic palace lofts, and the surface and road corners of the Heavenly Court all lit up, and countless multi-colored runic patterns suddenly appeared.

source: 在那剧烈的魔法波动席卷下，翡翠高塔外就仿佛刮起了一阵狂风，地面的纸屑尘土打着旋的被卷起，在天空中漫天飞舞着。
en_us: The violent magic wave seemed to bring along a gust of strong wind outside the Emerald Tower. Dust and scraps of paper on the ground were picked up and swirled like little dancers in the sky.

source: 在那漫天的火光当中，两道人影正缓缓落下，那是魔力耗尽的征兆。
en_us: Among the blazing light, two silhouettes descended slowly, a sign of mana exhaustion.

source: 在魔法常识上，林立完全无法与凯文相提并论，所以这种交谈，大多数时候都是林立提出一些常识性问题，而凯文则负责解答。
en_us: Lin Li could not be compared to Kevin on general magic knowledge. So, most of the conversation was Lin Li asking common sense questions and Kevin answering them.

source: 在龙血墨水干涸的同时，林立也划下了最后一根线条。
en_us: Lin Li drew the last line at the same time the dragon's blood ink dried up.

source: 地上十四五岁的小丫头也惊醒过来，看到暴怒冲来的江逸，一张小脸完全吓坏了，拼命的大喊起来：“少爷你不是他的对手，别管我，快走！”
en_us: The fourteen-year-old girl on the ground snapped to her senses. When she saw the wrathful Jiang Yi rushing over, she was scared out her wits. "Young Master,” she screamed with all her might, “you are not his match! Ignore me! Leave quickly!"

source: 地面一震，坚硬的青石板瞬间裂成两瓣，他的左拳深深的砸了进去，整个拳头都没入到石板下面的土里。
en_us: The ground shook. His left fist smashed right into the limestone slab and split it into two halves. His fist did not even hit the ground below the slab.

source: 场面有些失去控制，凯文却丝毫不显惊慌，只是面带笑容望着会场，耐心的等他们安静下来。
en_us: The scene was out of control, but Kevin was not in the least alarmed. He merely looked on with a smile on his face and waited patiently for them to quiet down.

source: 城主大人一句话出口，却隐隐发现气氛有些压抑，以他的心思，自是很快反应过来，自己正要介绍的这两个人，恐怕早就已经见过面了，不过艾萨克手腕圆滑，反应过来之后，脸上仍是丝毫不露，轻轻拍了拍红发美女挽着自己的小手：“来，罗琳，爸爸给你介绍一下，这位就是大名鼎鼎的费雷魔法师。”
en_us: The Castellan spoke but found the atmosphere rather oppressive. With his acumen, he naturally caught on quickly that the people he was about to introduce to each other had already met previously. However, Isaac was tactful in his approach. After he had grasped the situation, he did not reveal it on his face. He gently patted the redheaded beauty's hands that were holding him. "Come, Rowling. Let Father introduce you to the famous Mage Felic.

source: 城主府为了这次宴会，显然是花费了极大的心思。
en_us: The Castellan Mansion had evidently put in a great deal of effort for this banquet.

source: 城池北方的虚空之上异常诡异地裂开了一道裂缝，一双数丈长的白骨大手无声无息地自裂缝中伸出并把住裂缝的两边，将裂缝进一步撕开。
en_us: out of the the void in the north of the city, a strange crack appeared. From the crack a pair of long, skeletal hands stretched out and pushed the crack wider.

source: 堂堂八级魔兽，竟是被逼得满地打滚，再看上去又哪还有先前嚣张的气焰？
en_us: A mighty level-eight magical beast beaten to the ground, where did its previous arrogance go?

source: 填完表格之后，凯文又带着林立上了三楼，在穿过几条走廊之后，两人看见了已经在那等了很久的葛瑞安。
en_us: After filling out the form, Kevin brought Lin Li up to the third floor. They passed through a few corridors and finally saw Gerian who had long been waiting for them.

source: 声音传来的方向，正是罗麦格雷尼前所说的水源附近。
en_us: The voice came from the direction of the water source McGrenn had mentioned before.

source: 处理房产的事已经办砸，如果再连这件事也办不好，自己在家族的地位怕是很难保住了。
en_us: He had already messed up in his handling of the estates. If he couldn't even get this done well, it would be hard to keep his position in the family.

source: 夕阳余辉之下，天蓝色的玻璃瓶透射出比强能水晶更加璀璨的光晕。
en_us: Under the deepening eventide, the sky-blue bottled flared an even dazzling glow than the Strong Energy Crystal.

source: 外药，也就是上药和服药，内调则是通过运转体内元力，对伤处进行气血疏通和修补调节。所以江逸在上好药后，还要通过修炼江水诀，运转体内铸鼎境一重的元力，来帮助伤口更快复原。
en_us: In other words, one had to consume or apply any necessary medicine and direct the essence force in the body towards the wound. This would ensure the smooth circulation of blood and life force around the body to aid in regeneration. Thus, after applying medicine, Jiang Yi still had to practice the Jiang Water Art to circulate the essence force from the first stage of the Cast Tripod Realm and help his wounds heal faster.
